# -*- coding: utf-8 -*-
"""
Charles Truscott
ЧАРЛьЗ ТРУСКОТТ
runfile('C:/Users/user/Desktop/РУТ.py', wdir='C:/Users/user/Desktop')
guess: 2.654619617984281 high: 2.6546243488555774 low: 2.6546148871129844 numguesses: 35
guess: 2.6546172525486327 high: 2.654619617984281 low: 2.6546148871129844 numguesses: 36
guess: 2.6546160698308086 high: 2.6546172525486327 low: 2.6546148871129844 numguesses: 37
guess: 2.6546154784718965 high: 2.6546160698308086 low: 2.6546148871129844 numguesses: 38
guess: 2.6546151827924405 high: 2.6546154784718965 low: 2.6546148871129844 numguesses: 39
guess: 2.6546153306321685 high: 2.6546154784718965 low: 2.6546151827924405 numguesses: 40
guess: 2.6546154045520325 high: 2.6546154784718965 low: 2.6546153306321685 numguesses: 41
guess: 2.6546154415119645 high: 2.6546154784718965 low: 2.6546154045520325 numguesses: 42
guess: 2.6546154230319985 high: 2.6546154415119645 low: 2.6546154045520325 numguesses: 43
guess: 2.6546154322719815 high: 2.6546154415119645 low: 2.6546154230319985 numguesses: 44
guess: 2.65461542765199 high: 2.6546154322719815 low: 2.6546154230319985 numguesses: 45
guess: 2.6546154253419942 high: 2.65461542765199 low: 2.6546154230319985 numguesses: 46
guess: 2.6546154241869964 high: 2.6546154253419942 low: 2.6546154230319985 numguesses: 47
guess: 2.6546154247644953 high: 2.6546154253419942 low: 2.6546154241869964 numguesses: 48
guess: 2.6546154250532448 high: 2.6546154253419942 low: 2.6546154247644953 numguesses: 49
The 13 root of 325103 is 2.6546154251976195. 2.6546154251976195 ** 13 = 325102.99999548803
325103 ЗТО 13 РУТ 2.6546154251976195
((C + T) * (Ч + Т))^(1/13) = 2.6546154251976195

"""
import math

def main():
    гиссйс = 0
    ыпс = 0.000001
    куаж = (67 + 84) * (1063 + 1090)
    хи = куаж
    лу = 0
    гисс = (хи + лу) / 2.0
    n = 10
    ЙКСПОНЕНТ = 13

    while(round((гисс ** ЙКСПОНЕНТ), 4) != (куаж)):
        while (((гисс ** ЙКСПОНЕНТ) >= (куаж) or (гисс ** ЙКСПОНЕНТ) <= (куаж) and (not (гисс ** ЙКСПОНЕНТ) == (куаж)))):
            if гиссйс >= 35:
                print("guess: {} high: {} low: {} numguesses: {}".format(гисс, хи, лу, гиссйс))
            if ((гисс ** ЙКСПОНЕНТ) > куаж):
                хи = гисс
            elif ((гисс ** ЙКСПОНЕНТ) < куаж):
                лу = гисс
            гиссйс += 1
            гисс = (хи + лу) / 2.0
            if (round((гисс ** ЙКСПОНЕНТ), 4) == (round((куаж), 4))):
                break
                    
        
        print("The {} root of {} is {}. {} ** {} = {}".format(ЙКСПОНЕНТ, куаж, гисс, гисс,ЙКСПОНЕНТ, гисс ** ЙКСПОНЕНТ))
        print("{} ЗТО {} РУТ {}".format(куаж, ЙКСПОНЕНТ, гисс))
        print("(({} + {}) * ({} + {}))^(1/13) = {}".format('\x43', '\x54', '\u0427', '\u0442', гисс))
    
if __name__ == "__main__": main()